In [1]:
import pandas as pd
pandas.__version__

'0.25.1'

In [3]:
import pandas as pd
data=pd.Series([0.5,1,1.5,2])
data

0    0.5
1    1.0
2    1.5
3    2.0
dtype: float64

In [7]:
data.values

array([0.5, 1. , 1.5, 2. ])

In [8]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
data1=pd.Series([0.5,1,1.5,2],index=['a','b','c','d'])
data1

a    0.5
b    1.0
c    1.5
d    2.0
dtype: float64

In [17]:
data1['a']

0.5

In [18]:
data1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [19]:
 a={'pratik':7798,
    'pooja':230493,
    'pranali':311091}
a1=pd.Series(a)
a1

pratik       7798
pooja      230493
pranali    311091
dtype: int64

In [24]:
 a={'pratik':[7798,'black'],
    'pooja':[230493,'red'],
    'pranali':[311091,'blue']}
a1=pd.Series(a)
a1

pratik      [7798, black]
pooja       [230493, red]
pranali    [311091, blue]
dtype: object

In [29]:
name={1:'pratik',2:'taral',3:'hitesh',4:'shreyashi',5:'sagar'}
n=pd.Series(name)
n

1       pratik
2        taral
3       hitesh
4    shreyashi
5        sagar
dtype: object

In [30]:
marks={1:'70',2:'78',3:'65',4:'87'}
m=pd.Series(marks)
m

1    70
2    78
3    65
4    87
dtype: object

In [31]:
data=pd.DataFrame({'name':n,'marks':m})
data

        name marks
1     pratik    70
2      taral    78
3     hitesh    65
4  shreyashi    87
5      sagar   NaN

In [23]:
import pandas as pd
import numpy as np
z=pd.DataFrame(np.random.rand(3,2),
                columns=['foo','bar'],
                index=['a','b','c'])

In [33]:

z['foo']

a    False
b    False
c    False
Name: foo, dtype: bool

In [10]:
A=np.zeros(3,dtype=[('A','i8'),('B','f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [11]:
A=np.eye(3,dtype=[('A','i8'),('B','f8')])
A

array([[(1, 1.), (0, 0.), (0, 0.)],
       [(0, 0.), (1, 1.), (0, 0.)],
       [(0, 0.), (0, 0.), (1, 1.)]], dtype=[('A', '<i8'), ('B', '<f8')])

In [12]:
data1=pd.Series([0.5,1,1.5,2],index=['a','b','c','d'])
data1

a    0.5
b    1.0
c    1.5
d    2.0
dtype: float64

In [14]:
data1['b']

1.0

In [16]:
0.5 in data1

False

In [17]:
'a' in data1

True

In [34]:
data1['a':'c']

a    0.5
b    1.0
c    1.5
dtype: float64

In [35]:
data1[0:2]

a    0.5
b    1.0
dtype: float64

In [36]:
data1[(data1>0.3)&(data1<1.5)]

a    0.5
b    1.0
dtype: float64

In [37]:
data1[['a','c']]

a    0.5
c    1.5
dtype: float64

In [39]:
length={'a':5,'b':6,'c':9,'d':7,'e':5}
n=pd.Series(length)
n

a    5
b    6
c    9
d    7
e    5
dtype: int64

In [40]:
breadth={'a':5,'b':4,'c':2,'d':6,'e':1}
m=pd.Series(breadth)
m

a    5
b    4
c    2
d    6
e    1
dtype: int64

In [41]:
data=pd.DataFrame({'length':n,'breadth':m})
data

   length  breadth
a       5        5
b       6        4
c       9        2
d       7        6
e       5        1

In [45]:
data['area']=data['length']*data['breadth']
data

   length  breadth  area
a       5        5    25
b       6        4    24
c       9        2    18
d       7        6    42
e       5        1     5

In [46]:
data['perimeter']=2*(data['length']+data['breadth'])
data

   length  breadth  area  perimeter
a       5        5    25         20
b       6        4    24         20
c       9        2    18         22
d       7        6    42         26
e       5        1     5         12

In [47]:
data.values

array([[ 5,  5, 25, 20],
       [ 6,  4, 24, 20],
       [ 9,  2, 18, 22],
       [ 7,  6, 42, 26],
       [ 5,  1,  5, 12]], dtype=int64)

In [48]:
data.T

            a   b   c   d   e
length      5   6   9   7   5
breadth     5   4   2   6   1
area       25  24  18  42   5
perimeter  20  20  22  26  12

In [52]:
data

   length  breadth  area  perimeter
a       5        5    25         20
b       6        4    24         20
c       9        2    18         22
d       7        6    42         26
e       5        1     5         12

In [63]:
data.loc[:'c',:'area']#here c is row and area is column it takes values upto given row and column

   length  breadth  area
a       5        5    25
b       6        4    24
c       9        2    18

In [58]:
data.iloc[:3,:1]#here in iloc it takes index values from 0 till given idex no of rows and columns

   length
a       5
b       6
c       9

In [61]:
data.ix[:4,:'area']

C:\Users\pratik\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   length  breadth  area
a       5        5    25
b       6        4    24
c       9        2    18
d       7        6    42

In [70]:
data.loc[data.area<20,['area']]

   area
c    18
e     5

In [106]:
import pandas as pd
import numpy as np
popu=np.random.randint(0,1000000000,4)
pop=pd.Series((popu),index=['pune','mumbai','nashik','goa'])
pop

pune       73266285
mumbai    140371771
nashik    619341959
goa       718492912
dtype: int32

In [107]:
are=np.random.randint(0,1000000,4)
area=pd.Series((are),index=['pune','mumbai','nashik','goa'])
area

pune       35569
mumbai    415634
nashik    962612
goa       406958
dtype: int32

In [108]:
data=pd.DataFrame({'Population':pop,'Area':area})
data

        Population    Area
pune      73266285   35569
mumbai   140371771  415634
nashik   619341959  962612
goa      718492912  406958

In [109]:
data['density']=data['Population']/data['Area']
data

        Population    Area      density
pune      73266285   35569  2059.835390
mumbai   140371771  415634   337.729279
nashik   619341959  962612   643.397297
goa      718492912  406958  1765.521041

In [111]:
data.loc[:'nashik',:'Area']

        Population    Area
pune      73266285   35569
mumbai   140371771  415634
nashik   619341959  962612

In [114]:
data.iloc[:3,:2]

        Population    Area
pune      73266285   35569
mumbai   140371771  415634
nashik   619341959  962612

In [115]:
data

        Population    Area      density
pune      73266285   35569  2059.835390
mumbai   140371771  415634   337.729279
nashik   619341959  962612   643.397297
goa      718492912  406958  1765.521041

In [117]:
data.loc[data.density<500,['density']]

           density
mumbai  337.729279

In [123]:
r=np.random.RandomState(1)
x=pd.DataFrame(r.randint(0,10,(3,3)),index=[0,1,2])
print(x)

   0  1  2
0  5  8  9
1  5  0  0
2  1  7  6

In [133]:
y=pd.DataFrame(r.randint(0,10,(2,2)),index=[0,1])
print(y)

   0  1
0  1  8
1  8  3

In [134]:
x-y

     0    1   2
0  4.0  0.0 NaN
1 -3.0 -3.0 NaN
2  NaN  NaN NaN

In [135]:
x+y

      0     1   2
0   6.0  16.0 NaN
1  13.0   3.0 NaN
2   NaN   NaN NaN

In [136]:
x*y

      0     1   2
0   5.0  64.0 NaN
1  40.0   0.0 NaN
2   NaN   NaN NaN

In [137]:
x-x

   0  1  2
0  0  0  0
1  0  0  0
2  0  0  0